In [1]:
import numpy as np
import pandas as pd

In [6]:
raw_data = {'ID'        :['100',     '101',   '102',   '103',      '104'],
            'City'      :['Tokyo',   'Osaka', 'Kyoto', 'Hokkaido', 'Tokyo'],
            'Birth_year':[1990,      1989,    1992,    1997,       1982],
            'Name'      :['Hiroshi', 'Akiki', 'Yuki',  'Satoru',   'Steve']}
table = pd.DataFrame(raw_data, index=['a', 'b', 'c', 'd', 'e'])
table

    ID      City  Birth_year     Name
a  100     Tokyo        1990  Hiroshi
b  101     Osaka        1989    Akiki
c  102     Kyoto        1992     Yuki
d  103  Hokkaido        1997   Satoru
e  104     Tokyo        1982    Steve

### 刪除行

In [7]:
table.drop(['ID'], axis=1)

       City  Birth_year     Name
a     Tokyo        1990  Hiroshi
b     Osaka        1989    Akiki
c     Kyoto        1992     Yuki
d  Hokkaido        1997   Satoru
e     Tokyo        1982    Steve

### 刪除列

In [8]:
table.drop(['a'], axis=0)

    ID      City  Birth_year    Name
b  101     Osaka        1989   Akiki
c  102     Kyoto        1992    Yuki
d  103  Hokkaido        1997  Satoru
e  104     Tokyo        1982   Steve

In [9]:
table.drop(['a'], axis=0).reset_index(drop=True)

    ID      City  Birth_year    Name
0  101     Osaka        1989   Akiki
1  102     Kyoto        1992    Yuki
2  103  Hokkaido        1997  Satoru
3  104     Tokyo        1982   Steve